; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p18---int100n150-m25---int100c150---s519---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 - fuellevel
)

(:init
(sum level0 level13 level13)
(sum level0 level21 level21)
(sum level1 level13 level14)
(sum level1 level21 level22)
(sum level2 level13 level15)
(sum level2 level21 level23)
(sum level3 level13 level16)
(sum level3 level21 level24)
(sum level4 level13 level17)
(sum level4 level21 level25)
(sum level5 level13 level18)
(sum level5 level21 level26)
(sum level6 level13 level19)
(sum level6 level21 level27)
(sum level7 level13 level20)
(sum level7 level21 level28)
(sum level8 level13 level21)
(sum level8 level21 level29)
(sum level9 level13 level22)
(sum level9 level21 level30)
(sum level10 level13 level23)
(sum level10 level21 level31)
(sum level11 level13 level24)
(sum level11 level21 level32)
(sum level12 level13 level25)
(sum level12 level21 level33)
(sum level13 level13 level26)
(sum level13 level21 level34)
(sum level14 level13 level27)
(sum level14 level21 level35)
(sum level15 level13 level28)
(sum level15 level21 level36)
(sum level16 level13 level29)
(sum level16 level21 level37)
(sum level17 level13 level30)
(sum level17 level21 level38)
(sum level18 level13 level31)
(sum level18 level21 level39)
(sum level19 level13 level32)
(sum level19 level21 level40)
(sum level20 level13 level33)
(sum level20 level21 level41)
(sum level21 level13 level34)
(sum level21 level21 level42)
(sum level22 level13 level35)
(sum level22 level21 level43)
(sum level23 level13 level36)
(sum level23 level21 level44)
(sum level24 level13 level37)
(sum level24 level21 level45)
(sum level25 level13 level38)
(sum level25 level21 level46)
(sum level26 level13 level39)
(sum level26 level21 level47)
(sum level27 level13 level40)
(sum level27 level21 level48)
(sum level28 level13 level41)
(sum level28 level21 level49)
(sum level29 level13 level42)
(sum level29 level21 level50)
(sum level30 level13 level43)
(sum level30 level21 level51)
(sum level31 level13 level44)
(sum level31 level21 level52)
(sum level32 level13 level45)
(sum level32 level21 level53)
(sum level33 level13 level46)
(sum level33 level21 level54)
(sum level34 level13 level47)
(sum level34 level21 level55)
(sum level35 level13 level48)
(sum level35 level21 level56)
(sum level36 level13 level49)
(sum level36 level21 level57)
(sum level37 level13 level50)
(sum level37 level21 level58)
(sum level38 level13 level51)
(sum level38 level21 level59)
(sum level39 level13 level52)
(sum level39 level21 level60)
(sum level40 level13 level53)
(sum level40 level21 level61)
(sum level41 level13 level54)
(sum level41 level21 level62)
(sum level42 level13 level55)
(sum level42 level21 level63)
(sum level43 level13 level56)
(sum level43 level21 level64)
(sum level44 level13 level57)
(sum level44 level21 level65)
(sum level45 level13 level58)
(sum level45 level21 level66)
(sum level46 level13 level59)
(sum level46 level21 level67)
(sum level47 level13 level60)
(sum level47 level21 level68)
(sum level48 level13 level61)
(sum level48 level21 level69)
(sum level49 level13 level62)
(sum level49 level21 level70)
(sum level50 level13 level63)
(sum level50 level21 level71)
(sum level51 level13 level64)
(sum level51 level21 level72)
(sum level52 level13 level65)
(sum level52 level21 level73)
(sum level53 level13 level66)
(sum level53 level21 level74)
(sum level54 level13 level67)
(sum level54 level21 level75)
(sum level55 level13 level68)
(sum level55 level21 level76)
(sum level56 level13 level69)
(sum level56 level21 level77)
(sum level57 level13 level70)
(sum level57 level21 level78)
(sum level58 level13 level71)
(sum level58 level21 level79)
(sum level59 level13 level72)
(sum level59 level21 level80)
(sum level60 level13 level73)
(sum level60 level21 level81)
(sum level61 level13 level74)
(sum level61 level21 level82)
(sum level62 level13 level75)
(sum level62 level21 level83)
(sum level63 level13 level76)
(sum level63 level21 level84)
(sum level64 level13 level77)
(sum level64 level21 level85)
(sum level65 level13 level78)
(sum level65 level21 level86)
(sum level66 level13 level79)
(sum level66 level21 level87)
(sum level67 level13 level80)
(sum level67 level21 level88)
(sum level68 level13 level81)
(sum level68 level21 level89)
(sum level69 level13 level82)
(sum level69 level21 level90)
(sum level70 level13 level83)
(sum level70 level21 level91)
(sum level71 level13 level84)
(sum level71 level21 level92)
(sum level72 level13 level85)
(sum level72 level21 level93)
(sum level73 level13 level86)
(sum level73 level21 level94)
(sum level74 level13 level87)
(sum level74 level21 level95)
(sum level75 level13 level88)
(sum level75 level21 level96)
(sum level76 level13 level89)
(sum level76 level21 level97)
(sum level77 level13 level90)
(sum level77 level21 level98)
(sum level78 level13 level91)
(sum level78 level21 level99)
(sum level79 level13 level92)
(sum level79 level21 level100)
(sum level80 level13 level93)
(sum level80 level21 level101)
(sum level81 level13 level94)
(sum level81 level21 level102)
(sum level82 level13 level95)
(sum level83 level13 level96)
(sum level84 level13 level97)
(sum level85 level13 level98)
(sum level86 level13 level99)
(sum level87 level13 level100)
(sum level88 level13 level101)
(sum level89 level13 level102)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)

(at t0 l0)
(fuel t0 level102)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l0)
(at p8 l1)
(at p9 l0)
(at p10 l0)
(at p11 l0)
(at p12 l0)
(at p13 l2)
(at p14 l0)
(at p15 l2)
(at p16 l1)
(at p17 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l2)
(at p8 l0)
(at p9 l1)
(at p10 l2)
(at p11 l1)
(at p12 l2)
(at p13 l0)
(at p14 l1)
(at p15 l1)
(at p16 l0)
(at p17 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 18
2. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 0 of 18
3. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 18
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 18
5. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 18
6. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 18
7. (load p14 t0 l0)
   deleted: (at p14 l0)
   added: (in p14 t0)
   goals met: 0 of 18
8. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 18
9. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 18
10. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 18
11. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 18
12. (drive t0 l0 l2 level81 level21 level102)
   deleted: (at t0 l0) (fuel t0 level102)
   added: (at t0 l2) (fuel t0 level81)
   goals met: 0 of 18
13. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 1 of 18
14. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 18
15. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 2 of 18
16. (load p17 t0 l2)
   deleted: (at p17 l2)
   added: (in p17 t0)
   goals met: 2 of 18
17. (load p15 t0 l2)
   deleted: (at p15 l2)
   added: (in p15 t0)
   goals met: 2 of 18
18. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 2 of 18
19. (drive t0 l2 l1 level68 level13 level81)
   deleted: (at t0 l2) (fuel t0 level81)
   added: (at t0 l1) (fuel t0 level68)
   goals met: 2 of 18
20. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 3 of 18
21. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 4 of 18
22. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 5 of 18
23. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 6 of 18
24. (unload p17 t0 l1)
   deleted: (in p17 t0)
   added: (at p17 l1)
   goals met: 7 of 18
25. (unload p15 t0 l1)
   deleted: (in p15 t0)
   added: (at p15 l1)
   goals met: 8 of 18
26. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 9 of 18
27. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 10 of 18
28. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 10 of 18
29. (load p16 t0 l1)
   deleted: (at p16 l1)
   added: (in p16 t0)
   goals met: 10 of 18
30. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 10 of 18
31. (drive t0 l1 l0 level47 level21 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l0) (fuel t0 level47)
   goals met: 10 of 18
32. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 11 of 18
33. (unload p16 t0 l0)
   deleted: (in p16 t0)
   added: (at p16 l0)
   goals met: 12 of 18
34. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 13 of 18
35. (drive t0 l0 l2 level26 level21 level47)
   deleted: (at t0 l0) (fuel t0 level47)
   added: (at t0 l2) (fuel t0 level26)
   goals met: 13 of 18
36. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 14 of 18
37. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 15 of 18
38. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 16 of 18
39. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 17 of 18
40. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 18 of 18
